# Docker-команда FROM вказує базовий образ контейнера
# Наш базовий образ - це Windows з попередньо встановленим python-3.8.10
FROM python:3.8.10-slim

# Встановимо змінну середовища
ENV FLASK_APP = app.py

# Встановимо робочу директорію всередині контейнера
WORKDIR /app

# Скопіюємо інші файли в робочу директорію контейнера
COPY . /app

# Встановимо залежності всередині контейнера
RUN pip install -r requirements.txt - dir poetry

# Позначимо порт, де працює застосунок всередині контейнера
EXPOSE 8080

# Запустимо наш застосунок всередині контейнера
ENTRYPOINT ["python", "app.py"]

CMD ["flask", "run", "--host=0.0.0.0", "--port=8080"]

